"""''''''"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""''''''

# переменные это ссылки на ячейки памяти , где хранятся какие то данные

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""''''''
                                               '''ВВОД И ВЫВОД ДАННЫХ   '''                         
'''print = функция вывода данных в терминале
input = функция ввода данных в терминале '''

"""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""""''''''
'''integers (int) = целые числа (5, 10, -51, 0, 1)
a = 5
b = 5 
print(a+b)
    float = вещественные с плавающей точкой ( 0.4, 0.3, 414.41, 3.14(door)
a = 1.2
b = 5.1
print(a+b)
    dessimal = точное вещественное число ()
    the same
    complex - комплексные  числа
    the same
    decimal  = чтоб юзать нужно жкспоритоварть 
    the same '''


"""""""""""""""""""""""""""""""""""""""""""""""from email.policy import strict
from typing import MutableMapping


операции над функциями""""""""""""""""""""""""""""

5 + 5 # plus
5 - 5 # minus
5 * 5 # умножку
5 / 5 # delenie не полное
5 // 5 # целочисленное деление (int 1 )
5 ** 5 # возведение в степень
# two ways to fint KOREN
25 ** 0.5 # квадратные корень числа
5 % 2 #  остаток от деления 
sqrt # функиця для  нахождения корня числа
(to use , need to import frim math library)
sqrt(24) # 4/6
sqrt(36) # 6
sqrt(49) # 7



# что такое модуль числа = из отрицательного в положительный
 [-5] - 5
 abs (5) # 5
 abs (10)# 10
 abs (-2.4) # 2.4

 # pow - эт функция #
 # 1 действие =возводит число в определенную степень
 #  а 2 действие = возвращает остаток от деления рехультата 1 действия в третье число
 # 
pow(2, 3) # 8 - 2 ** 3
pow(2, 3, 4)# 8 % 4 - 0
# (2 ** 3) % 4 - 4 
# 
#  
# 
#делит 2 числа и отдает 2 числа как  (int and float)  мега функция которая ахренительно делит, и это divmod
  divmod - (15, 2) # 7,1
  divmod - (9, 3) # 3,0

  # функция для округлениya( especiially ti high results) round ___+++_+_+_+_+_+__+_+__+__+_+_+__+_+_+
  round (4,5) #




'''

'''A = 5
b = 5
print(A+b)
'''

'''a = input()
print(a)
'''

'''a = input()
print("Ввееденное число ",a ) 
'''"""

'''1) Напишите программу, которая просит пользователя ввести последовательно день своего рождения, затем месяц и в конце год рождения.
 На выходе программа должна выдавать вам сумму введенных чисел.'''
'''
a = input('Введите свой день рождение!')
b = input('Введите свой месяц рождения!')
c = input('Введите свой год рождения!')
print('a+b+c')

'''

